In [1]:
#Pandasın amacı mümkün olduğunca ağrısız, eksik olmayan verilerle çalışmaktır.
#verinin özet istatistikleri, eksik veriyi yok sayarak bulunur.

In [2]:
import pandas as pd
import numpy as np

In [3]:
#Pandasta eksik veri NaN ile gösterilir.
s = pd.Series(["ege",np.nan,"ali","eda"])
s

0    ege
1    NaN
2    ali
3    eda
dtype: object

In [5]:
#Eksik veriyi tespit etmek için .isnull() methodu kullanılır.
s.isnull()

0    False
1     True
2    False
3    False
dtype: bool

In [6]:
#Eksik veri olmayanı tespit etmek için .notnull() methodu kullanılır.
s.notnull()

0     True
1    False
2     True
3     True
dtype: bool

In [9]:
s[3] = None #hangi satırı eksik veri yapmak istiyorsak indexini parantez içine giriyoruz.

In [11]:
s.isnull() #kontrol.

0    False
1     True
2    False
3     True
dtype: bool

In [12]:
#Eksik veriye sahip olan değeleri silmek istiyorsak. .dropna() methodu kullanılır.
s.dropna()

0    ege
2    ali
dtype: object

In [13]:
from numpy import nan as NA #DataFrame için eksik değeri ekliyo

In [16]:
df = pd.DataFrame([[1,2,3],[4,NA,5],[NA,NA,NA]])
df

     0    1    2
0  1.0  2.0  3.0
1  4.0  NaN  5.0
2  NaN  NaN  NaN

In [18]:
df.dropna() #eksik verileri kaldırır.

     0    1    2
0  1.0  2.0  3.0

In [21]:
df.dropna(how = "all") #how = "all" methodu butun değerleri eksik veri olan satırı kaldırır.

     0    1    2
0  1.0  2.0  3.0
1  4.0  NaN  5.0

In [22]:
df

     0    1    2
0  1.0  2.0  3.0
1  4.0  NaN  5.0
2  NaN  NaN  NaN

In [25]:
df[1] = NA #2. stununa eksik veri atadık.
df

     0   1    2
0  1.0 NaN  3.0
1  4.0 NaN  5.0
2  NaN NaN  NaN

In [34]:
df.dropna(axis = 1, how ="all") #butun değerleri eksik veri olan sutunu kaldırır.
df

     0   1    2
0  1.0 NaN  3.0
1  4.0 NaN  5.0
2  NaN NaN  NaN

In [36]:
df.dropna(how="all")

     0   1    2
0  1.0 NaN  3.0
1  4.0 NaN  5.0

In [37]:
df.dropna(thresh = 1) #en az 1 değerine sahip olan değerler ekrana yazılır.

     0   1    2
0  1.0 NaN  3.0
1  4.0 NaN  5.0

In [41]:
df.dropna(thresh = 2) #en az 2 değerine sahip olan değerler ekrana yazılır. eğer 3 yaparsak en az 3 tane değer veri setinde olmadığı için ekrana hiçbişe yazılmaz.

     0   1    2
0  1.0 NaN  3.0
1  4.0 NaN  5.0

In [44]:
#EKSİK VERİ YERİNE BAŞKA BİR DEĞER ATAMAK İSTERSEK .fillna() METHODU KULLANILIR.
df.fillna(0) #eksik verilerin yerine 0 atadı.

     0    1    2
0  1.0  0.0  3.0
1  4.0  0.0  5.0
2  0.0  0.0  0.0

In [45]:
df.fillna(8) #eksik verilerin yerine 8 atadı

     0    1    2
0  1.0  8.0  3.0
1  4.0  8.0  5.0
2  8.0  8.0  8.0

In [47]:
 df.fillna({0:15,1:25,2:35}) #bu şekilde 0. 1. ve 2. sutunların yerindeki eksik verilerin yerine ne geleceğine karar verdik.

      0     1     2
0   1.0  25.0   3.0
1   4.0  25.0   5.0
2  15.0  25.0  35.0

In [48]:
#fillna methodu kalıcı değil yani 
df #gördüğünüz gibi eski haline geri döndü. bunun yerine inplace = True methodu kullanılır.

     0   1    2
0  1.0 NaN  3.0
1  4.0 NaN  5.0
2  NaN NaN  NaN

In [50]:
df.fillna(0, inplace = True)
df

     0    1    2
0  1.0  0.0  3.0
1  4.0  0.0  5.0
2  0.0  0.0  0.0

In [51]:
df = pd.DataFrame([[1,2,3],[4,NA,5],[NA,NA,NA]])
df

     0    1    2
0  1.0  2.0  3.0
1  4.0  NaN  5.0
2  NaN  NaN  NaN

In [52]:
#eğer eksik veriye bir üstteki değeri atamak istersek
df.fillna(method= "ffill")

     0    1    2
0  1.0  2.0  3.0
1  4.0  2.0  5.0
2  4.0  2.0  5.0

In [53]:
df.fillna(method= "ffill", limit = 1) #sadece 1 tane limiti koyduk değerin altındaki alır. onun altındaki almaz.

     0    1    2
0  1.0  2.0  3.0
1  4.0  2.0  5.0
2  4.0  NaN  5.0

In [55]:
#eksik veri yerine ortalama değeri atamak istersek.
veri = pd.Series([1,0,NA,5])
veri

0    1.0
1    0.0
2    NaN
3    5.0
dtype: float64

In [56]:
veri.fillna(veri.mean()) #veririn ortalamasını eksik verilere atadı.

0    1.0
1    0.0
2    2.0
3    5.0
dtype: float64

In [57]:
#şimdi dataframe de sıra
df

     0    1    2
0  1.0  2.0  3.0
1  4.0  NaN  5.0
2  NaN  NaN  NaN

In [58]:
df.fillna(veri.mean()) #datadrame veri yapısında da bu şekilde yapılır. #Sutunların ortalamasını hesaplar.

     0    1    2
0  1.0  2.0  3.0
1  4.0  2.0  5.0
2  2.0  2.0  2.0